// [TOPIC]: 给定两个整数 a 和 b ，求它们的除法的商 a/b ，要求不得使用乘号 '*'、除号 '/' 以及求余符号 '%' 。

/**
 * [TIPS]:
 * 整数除法的结果应当截去（truncate）其小数部分，例如：truncate(8.345) = 8 以及 truncate(-2.7335) = -2
 * 假设我们的环境只能存储 32 位有符号整数，其数值范围是 [−231, 231−1]。本题中，如果除法结果溢出，则返回 231 − 1
 */



/**
 * @param {number} a
 * @param {number} b
 * @return {number}
 */
 var divide = function(a, b) {

};


//  输入：a = 15, b = 2
//  输出：7
//  解释：15/2 = truncate(7.5) = 7

//  输入：a = 7, b = -3
//  输出：-2
//  解释：7/-3 = truncate(-2.33333..) = -2

//  输入：a = 1, b = 1
//  输出：1

//  输入：a = 0, b = 1
//  输出：0